phil971-kant-rational-agency.org
#+TITLE: PHIL 971 - Kantian Conceptions of Rational Agency
#+DATE: July 2, 2020
#+AUTHOR: Colin McLear
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport archive nohugo
#+TODO: TODO NEXT | DONE CANCELED
#+TODO: DRAFT | DONE CANCELED
#+LANGUAGE: en
#+LATEX_HEADER: \usepackage[English]{babel}
#+OPTIONS: '":t

*** DONE Week 4 – Reflection, Inference, & Agency
SCHEDULED: <2020-09-08 Tue>
:PROPERTIES:
:EXPORT_HUGO_TAGS: action agency animals control inference reasoning 
:EXPORT_FILE_NAME: week4
:END:

We’ll finish up our discussion of control and time this week. We then move on to look
at how Kant conceives of the freedom of the rational subject (in all its metaphysical
demandingness) includes even the activity of making inferences. We’ll discuss various
issues surrounding Kant’s conception of inference, and why he thinks it is so
metaphysically demanding. I’ve also linked two recent articles. The first, by Ram
Neta, on the “basing relation”, has a variety of points of connection with Kant’s own
view. The second, by Paul Boghossian, is on the “taking condition” more generally as
an account of inference.

**** Readings
- Kant (these are the same as last week)
   + /Groundwork of the Metaphysics of Morals/: part II, 4:412-4:414; part III, 4:446-9
   + /[[/materials/readings/kant-review-schulz.pdf][Review of Schultz]]/
      + Read the whole thing, but focus on the argument starting from the first full
        paragraph on 8:13 to the end. 
   + /Critique of Practical Reason/: 5:94-101 
- Secondary readings:
   + McLear, [[https://www.dropbox.com/s/d3v0qnnc2nqt45f/inference.pdf?dl=0][Inference]]
   + McLear (Optional), “[[https://philpapers.org/rec/MCLOTT][On the Transcendental Freedom of the Intellect]]” (just §§4.2-4.3)
- Neta, “[[/materials/readings/neta-basing.pdf][The Basing Relation]]”
- Boghossian (Optional), “[[/materials/readings/boghossian-inference.pdf][What is Inference?]]”  

  
