content/assignments/week4.md
+++
title = "Week 4 – Inference & Agency"
publishDate = 2020-09-08T00:00:00-04:00
tags = ["action", "agency", "animals", "control", "inference", "reasoning"]
draft = true
weight = -100
author = false
toc = false
type = "post"
+++

We’ll finish up our discussion of control and time this week. We then move on to look
at how Kant conceives of the freedom of the rational subject (in all its metaphysical
demandingness) includes even the activity of making inferences. We’ll discuss various
issues surrounding Kant’s conception of inference, and why he thinks it is so
metaphysically demanding. I’ve also linked two recent articles. The first, by Ram
Neta, on the “basing relation”, has a variety of points of connection with
Kant’s own view. The second, by Paul Boghossian, is on the “taking condition” as an
account of inference.


## Readings {#readings}

-   Kant (most of these are the same as last week)
    -   _Groundwork of the Metaphysics of Morals_: part II, 4:412-4:414; part III, 4:446-9
    -   _[Review of Schultz](/materials/readings/kant-review-schulz.pdf)_
        -   Read the whole thing, but focus on the argument starting from the first full
            paragraph on 8:13 to the end.
    -   _Critique of Practical Reason_: 5:94-101
-   Secondary readings:
    -   McLear, [Inference](https://www.dropbox.com/s/d3v0qnnc2nqt45f/inference.pdf?dl=0)
    -   McLear (Optional), “[On the Transcendental Freedom of the Intellect](https://philpapers.org/rec/MCLOTT)” (just §§4.2-4.3)
-   Neta, “[The Basing Relation](/materials/readings/neta-basing.pdf)”
-   Boghossian (Optional), “[What is Inference?](/materials/readings/boghossian-inference.pdf)”
